xiaocainiao11111/x_track_learn/template/Keil.AT32F4xx_DFP.1.3.7/SVD/AT32F421xx.svd
        <register>
          <name>IPR14</name>
          <displayName>IPR14</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x438</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IPR_N0</name>
              <description>IPR_N0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IPR_N1</name>
              <description>IPR_N1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IPR_N2</name>
              <description>IPR_N2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IPR_N3</name>
              <description>IPR_N3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
	<peripheral>
      <name>COMP</name>
      <description>Compare</description>
      <groupName>COMP</groupName>
      <baseAddress>0x4001001C</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC_COMP</name>
        <description>ADC and COMP interrupt</description>
        <value>12</value>
      </interrupt>	  
      <registers>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>Comp control/status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COMPEN</name>
              <description>Comparator enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>COMPSW</name>
              <description>Comparator non inverting input DAC switch</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>COMPMDE</name>
              <description>Comparator mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>			
			<field>
              <name>COMPINMSEL</name>
              <description>Comparator inverting input selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>COMPINPSEL</name>
              <description>Comparator input selection bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>COMPOUTSEL</name>
              <description>Comparator output selection bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>COMPPOL</name>
              <description>Comparator polarity selection bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>			
			<field>
              <name>COMPHYST</name>
              <description>Comparator hysteresis bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>COMPBLANKING</name>
              <description>Comparator blanking bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>BRGEN</name>
              <description>Comparator brgen bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>SCALEN</name>
              <description>Comparator scalen bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>COMPVALUE</name>
              <description>Comparator output status bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
			<field>
              <name>COMPLOCK</name>
              <description>COMP_CSR1[15:0] register lock bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>	
        <register>
          <name>G_FILTER_EN</name>
          <displayName>G_FILTER_EN</displayName>
          <description>G_FILTER_EN</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>GFE</name>
              <description>Glitch filter enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HIGH_PULSE</name>
          <displayName>HIGH_PULSE</displayName>
          <description>HIGH_PULSE</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>H_PULSE_CNT</name>
              <description>High pulse Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>LOW_PULSE</name>
          <displayName>LOW_PULSE</displayName>
          <description>LOW_PULSE</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>L_PULSE_CNT</name>
              <description>Low pulse Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
   </peripherals>
  </device>
